Revit 2027 API
GraphicsStyle.GraphicsStyleCategory Property
The graphics style category.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Category GraphicsStyleCategory { get; }
Public ReadOnly Property GraphicsStyleCategory As Category
	Get
public:
property Category^ GraphicsStyleCategory {
	Category^ get ();
}
member GraphicsStyleCategory : Category with get
Property Value
Category
See Also
Reference
GraphicsStyle Class
Autodesk.Revit.DB Namespace